parsing-tech-log/src/Catalogs/УчетныеЗаписи/УчетныеЗаписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписи</name>
  <attributes>
    <name>API</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

parsing-tech-log/src/Catalogs/УчетныеЗаписи/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьСписокДоступныхAPI();
	ИзменитьВидимостьЭлементовAPI(ВыборAPI);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ЗначениеЗаполнено(Объект.API) Тогда
		ВыборAPI = Объект.API;
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура СформироватьСписокДоступныхAPI()
	
	Если НЕ ЗначениеЗаполнено(ВыборAPI) Тогда
		ВыборAPI = "другое";
	КонецЕсли;
	
	Элементы.ВыборAPI.СписокВыбора.Добавить("skype");
	Элементы.ВыборAPI.СписокВыбора.Добавить("ms teams");
	Элементы.ВыборAPI.СписокВыбора.Добавить("telegram");
	Элементы.ВыборAPI.СписокВыбора.Добавить("почта");
	Элементы.ВыборAPI.СписокВыбора.Добавить("другое");
КонецПроцедуры

&НаКлиенте
Процедура ВыборAPIПриИзменении(Элемент)
	Объект.API = ВыборAPI;
	ИзменитьВидимостьЭлементовAPI(ВыборAPI);
	ЗаполнитьТабличнуюЧастьВыбраннымAPI(ВыборAPI);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьЭлементовAPI(API)
	
	Если API="другое" Тогда
		Элементы.API.Видимость = Истина;
	Иначе
		Элементы.API.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьТабличнуюЧастьВыбраннымAPI(API)
	
	СтрокаНастроек = "";
	
	Если API="skype" Тогда
		СтрокаНастроек = "IDПриложения
		|IDЧата
		|Пароль";	
	ИначеЕсли API="ms teams" Тогда
		СтрокаНастроек = "IDПриложения
		|IDКоманды
		|IDКанала
		|Пароль";	
	ИначеЕсли API="telegram" Тогда
		СтрокаНастроек = "Токен
		|IDЧата
		|Пароль";	
	ИначеЕсли API="почта" Тогда
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаНастроек) Тогда
		Объект.Настройки.Очистить();
	КонецЕсли;	
	
	МассивНастроек = СтрРазделить(СтрокаНастроек,Символы.ПС,Ложь );
	
	Для каждого стр из МассивНастроек Цикл
		стр_н = Объект.Настройки.Добавить();
		стр_н.Наименование = стр;
		стр_н.Значение = "";
	КонецЦикла;
	
КонецПроцедуры
